defdist.md

# Table of Contents

1.  [Hosts](#orgd3ba966)
    1.  [Orange](#org8efc677)
        1.  [Advantages](#orgef60858)
        2.  [Disadvantages](#org8763ba3)
    2.  [Flokinet](#orgf60956a)
        1.  [Advantages](#org20ce5e1)
        2.  [Disadvantages](#org2b2b170)
    3.  [Epik (Sibyl hosting)](#org69456e0)
        1.  [Advantages](#orgb822f0a)
        2.  [Disadvantages](#orga79ac58)
        3.  [Other features](#orga31ec54)
    4.  [Bahnhof](#org319e6a4)
        1.  [Advantages](#orgc92c044)
        2.  [Disadvantages](#org67ab5f0)
    5.  [Njalla](#org095eb14)
        1.  [Advantages](#org01db767)
        2.  [Disadvantages](#orga6846fa)
        3.  [About](#orgfcbd909)
    6.  [Dreamhost](#org7c09406)
        1.  [Advantages](#orgf3749b8)
        2.  [Disadvantages](#org8f10742)
    7.  [Vanwa.tech](#org2de2ba0)
        1.  [Advantages](#orgc563aea)
        2.  [Disadvantages](#org64adfdd)
2.  [Distributed/Decentralized solutions](#orgb8d93c5)


<a id="orgd3ba966"></a>

# Hosts


<a id="org8efc677"></a>

## Orange

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Location</th>
<th scope="col" class="org-left">Types</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">(Iceland)</td>
<td class="org-left">Dedicated/Cloud</td>
</tr>
</tbody>
</table>


<a id="orgef60858"></a>

### Advantages

1.  Deplatforming &#x2013; Probably unlikely, examples:

    1.  Used by lots of tor exit nodes

    2.  Says no only to "racist or pro-paedophilia content"

    3.  Otherwise, ignores complaints

2.  Security &#x2013; DDOS Protection at several levels

3.  Privacy &#x2013; Accepts Bitcoin

4.  Privacy &#x2013; Minimal KYC

5.  Flexibility &#x2013; Cloud and Dedicated options


<a id="org8763ba3"></a>

### Disadvantages

1.  Location &#x2013; only one: Iceland

2.  Location &#x2013; Isolated Europe, slower connections from USA


<a id="orgf60956a"></a>

## Flokinet

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Location</th>
<th scope="col" class="org-left">Types</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">(Romania)/Iceland/Finland</td>
<td class="org-left">Dedicated/Colocation</td>
</tr>
</tbody>
</table>


<a id="org20ce5e1"></a>

### Advantages

1.  Deplatforming &#x2013; Unlikely

2.  Security &#x2013; DDOS Protection at several levels

3.  Privacy &#x2013; Accepts Bitcoin

4.  Privacy &#x2013; Minimal KYC

5.  Privacy &#x2013; Advertises free speech

6.  Cloud/Dedicated/Colocation options


<a id="org2b2b170"></a>

### Disadvantages

1.  Location &#x2013; Europe, slower connections from USA


<a id="org69456e0"></a>

## Epik (Sibyl hosting)

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Location</th>
<th scope="col" class="org-left">Types</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">(UK)/Netherlands/Switzerland/Norway</td>
<td class="org-left">VPS/Dedicated/Colocation/Cloud</td>
</tr>
</tbody>
</table>


<a id="orgb822f0a"></a>

### Advantages

1.  Deplatforming &#x2013; Unlikely

2.  Security &#x2013; DDOS Protection offered at several levels

3.  Security &#x2013; Says "DMCA Ignored" for most options

4.  Security &#x2013; Says "Physical security, Norway bunker"

5.  Privacy &#x2013; Accepts Bitcoin

6.  Privacy &#x2013; Minimal KYC

7.  Privacy &#x2013; Advertises free speech

8.  Privacy &#x2013; Well-known recipient of censored migrants

9.  Cloud/Dedicated/Colocation options


<a id="orga79ac58"></a>

### Disadvantages

1.  Location &#x2013; UK based company,  Dedicated services in UK

2.  Location &#x2013; VPSs in Norway, Netherlands and Switzerland

3.  Company hosting looks new and is still being setup


<a id="orga31ec54"></a>

### Other features

Epik has an Openstack Based cloud computing solution using KVM, Linux's
Kernel-based Virtual Machine. "Our Norway Datacenter runs inside a bunker with
maximum physical security so you can be sure your data is safe."
"


<a id="org319e6a4"></a>

## Bahnhof

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Location</th>
<th scope="col" class="org-left">Types</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">(Sweden)</td>
<td class="org-left">VPS/Cloud/Colocation</td>
</tr>
</tbody>
</table>


<a id="orgc92c044"></a>

### Advantages

1.  Deplatforming &#x2013; Unlikely, former Wikileaks host

    "With all infrastructure in Sweden, our cloud services run under the
    country's strong free speech and data protection laws. Your information is
    protected against foreign surveillance."

2.  Flexible Cloud/VPS plans, much like Amazon


<a id="org67ab5f0"></a>

### Disadvantages

1.  Location &#x2013; Sweden, Europe


<a id="org095eb14"></a>

## Njalla

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Location</th>
<th scope="col" class="org-left">Types</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">(Sweden)</td>
<td class="org-left">VPS</td>
</tr>
</tbody>
</table>


<a id="org01db767"></a>

### Advantages

1.  Domain provider as well as hosting

2.  Deplatforming &#x2013; Unlikely, they're Piratebay and Piratbyran guys

3.  Privacy &#x2013; Accepts Cryptocurrency

4.  Privacy &#x2013; Holds domain in between you and registrar


<a id="orga6846fa"></a>

### Disadvantages

1.  Location &#x2013; VPSs in Sweden, Europep

2.  Only 3 VPS choices, no cloud or dedicated

3.  Not a lot of control over the machine setup it appears

4.  Company hosting looks new and is still being setup


<a id="orgfcbd909"></a>

### About

"When you buy a domain in our system, we're actually purchasing it for ourselves.
We will be the actual owners of the domain, it's not an ownership by proxy as
found with all other providers. However, you will still have the full control
over the domain name. You can either use our information, our nameservers or you
can go with your custom data.
&#x2026;
The idea is to make sure that we minimise your visibility to the public. We're
not going to give your customer data out easily.
"


<a id="org7c09406"></a>

## Dreamhost

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Location</th>
<th scope="col" class="org-left">Types</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">(USA)</td>
<td class="org-left">VPS/Cloud/Dedicated</td>
</tr>
</tbody>
</table>


<a id="orgf3749b8"></a>

### Advantages

1.  Amazon-like services

    1.  DreamCompute &#x2013; cloud, scalable infra

    2.  DreamObjects &#x2013; S3-type redundant object storage

2.  Deplatforming &#x2013; Unlikely, example content hosted:

    1.  American Nazi Party

    2.  Pornography

    3.  Offensive material like Prophet Muhammed cartoons

3.  Location &#x2013; USA based

4.  KVM Virtualization

5.  Lots of services to choose from

6.  Domain provider and hosting

7.  OS-Agnostic, flexibility for setups


<a id="org8f10742"></a>

### Disadvantages

1.  Doesn't advertise "free speech" necessarily

2.  only has normal terms for "illegal and copyrighted content"


<a id="org2de2ba0"></a>

## Vanwa.tech

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Location</th>
<th scope="col" class="org-left">Types</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">(USA, Washington State)</td>
<td class="org-left">VPS/Cloud/Dedicated/Colocation</td>
</tr>
</tbody>
</table>


<a id="orgc563aea"></a>

### Advantages

1.  Deplatforming &#x2013; Probably Unlikely:

    1.  8kun/8chan host

2.  Deplatforming &#x2013; Advertises "free speech"

3.  Security &#x2013; DDOS Protection for servers

4.  KVM Virtualization

5.  Unmetered Bandwidth @ 1GB/s

6.  Domain provider and hosting

7.  Provides APIs for IPFS actions


<a id="org64adfdd"></a>

### Disadvantages

1.  Says "cloud" but resources don't appear adjustable

2.  Hosting options arent that great


<a id="orgb8d93c5"></a>

# Distributed/Decentralized solutions
